JmeterTest01-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: JmeterTest01-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: JmeterTest01-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  JmeterTest01-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1536,713)
      - go(chrome://newtab/)
      - go(https://www.google.com/search?q=demoblaze&oq=demoblaze&aqs=chrome.0.0i512l4j0i10i512l3j69i60.2204j0j7&sourceid=chrome&ie=UTF-8)
      - clickByXPath(//*[contains(text(), "STORE")])
      - clickByXPath(//*[text() = "STORE"])
      - go(https://www.demoblaze.com/)
      - clickByXPath(//*[text() = "The Samsung Galaxy S6 is powered by 1.5GHz octa-core Samsung Exynos 7420 processor and it comes with 3GB of RAM. The phone packs 32GB of internal storage cannot be expanded."])
      - clickByXPath(//*[text() = "Samsung galaxy s7"])
      - clickByXPath(//*[text() = "Add to cart"])
      - clickByXPath(//*[text() = "Contact"])
      - clickByXPath(//*[text() = "Send message"])
      - clickByCSS(div.modal-backdrop.fade)
      - clickByXPath(//*[text() = "Add to cart"])
      - clickByXPath((//*[text() = "Log in"])[3])
      - clickByXPath((//*[text() = "Log in"])[2])
      - clickByID(loginusername)
      - clickByXPath(//*[contains(text(), "Close")])
      - clickByXPath((//*[text() = "Close"])[3])

  JmeterTest01-Http:
    headers:
      sec-ch-ua: '"Chromium";v="112", "Google Chrome";v="112", "Not:A-Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/112.0.0.0 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://www.google.com/search'
            method: GET
            label: 'https://www.google.com/search'
            think-time: 0ms
            headers:
              sec-ch-ua-full-version: '"112.0.5615.138"'
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
            body:
              q: demoblaze
              oq: demoblaze
              aqs: chrome.0.0i512l4j0i10i512l3j69i60.2204j0j7
              sourceid: chrome
              ie: UTF-8
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-full-version: '"112.0.5615.138"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-model: '""'
              sec-ch-ua-wow64: '?0'
              Accept: '*/*'
            body:
              q: ''
              cp: '0'
              client: gws-wiz-serp
              xssi: t
              hl: en-BD
              authuser: '0'
              pq: demoblaze
              psi: TlhPZLvVIPDq2roPk_mEmAU.1682921542692
              dpr: '1.25'
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-full-version: '"112.0.5615.138"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-model: '""'
              sec-ch-ua-wow64: '?0'
              Accept: '*/*'
            body:
              q: demoblaze
              cp: '0'
              client: gws-wiz-serp
              xssi: t
              hl: en-BD
              authuser: '0'
              pq: demoblaze
              psi: TlhPZLvVIPDq2roPk_mEmAU.1682921542692
              dpr: '1.25'
              ofp: EAE
          - url: 'https://www.google.com/xjs/_/js/md=1/k=xjs.s.en_GB.gyjxiIQ3po0.O/am=YkAAokE4ZWSjMIAuMAAAgIEAAAAAAKAEwzQABO8_YQAAAIhgCGKwAEBSAgwAAABw-iECIAAAQGAAAACgBPBjASpAAAAAAKQPQDkvABxMWAAAAAAAAAAAgIAlCAYXSFIQAAIAAAAAAAAAAFUyeSUgBACgAg/rs=ACT90oHbkvXV9VPicK4NqroKnX-8_tYGTg'
            method: GET
            label: 'https://www.google.com/xjs/_/js/md=1/k=xjs.s.en_GB.gyjxiIQ3po0.O/am=YkAAokE4ZWSjMIAuMAAAgIEAAAAAAKAEwzQABO8_YQAAAIhgCGKwAEBSAgwAAABw-iECIAAAQGAAAACgBPBjASpAAAAAAKQPQDkvABxMWAAAAAAAAAAAgIAlCAYXSFIQAAIAAAAAAAAAAFUyeSUgBACgAg/rs=ACT90oHbkvXV9VPicK4NqroKnX-8_tYGTg'
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-full-version: '"112.0.5615.138"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-model: '""'
              sec-ch-ua-wow64: '?0'
              Accept: '*/*'
          - url: 'https://www.google.com/async/asyncContextualTask'
            method: GET
            label: 'https://www.google.com/async/asyncContextualTask'
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-full-version: '"112.0.5615.138"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-model: '""'
              sec-ch-ua-wow64: '?0'
              Accept: '*/*'
            body:
              ei: TlhPZLvVIPDq2roPk_mEmAU
              opi: '89978449'
              yv: '3'
              cid: '11218169727997694849'
              cs: '1'
              async: '_ck:xjs.s.GXuRDM4N-EQ.L.W.O,_fmt:prog,_id:rNi7Zc'
          - url: 'https://www.google.com/async/asyncContextualTask'
            method: GET
            label: 'https://www.google.com/async/asyncContextualTask'
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-full-version: '"112.0.5615.138"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-model: '""'
              sec-ch-ua-wow64: '?0'
              Accept: '*/*'
            body:
              ei: TlhPZLvVIPDq2roPk_mEmAU
              opi: '89978449'
              yv: '3'
              cid: '3766468462869615738'
              cs: '1'
              async: '_ck:xjs.s.GXuRDM4N-EQ.L.W.O,_fmt:prog,_id:rNi7Zc'
          - url: 'https://play.google.com/log?format=json&hasfast=true&authuser=0'
            method: POST
            label: 'https://play.google.com/log?format=json&hasfast=true&authuser=0'
            headers:
              Content-Type: application/x-www-form-urlencoded;charset=UTF-8
              X-Goog-AuthUser: '0'
              Authorization: SAPISIDHASH cc1440551ad7891a28d6688dee582507c92f4495
              Accept: '*/*'
            body: "[[1,null,null,null,null,null,null,null,null,null,[null,null,null,null,\"en-BD\",null,null,null,null,[1,false,0]]],1655,[[\"1682921543749\",null,[],null,null,null,null,\"[[[\\\"/client_streamz/location/location_prompt/prompt_decisions_count\\\",null,[\\\"decision\\\",\\\"browser\\\"],[[[[\\\"NO_PROMPT_NOT_GRANTED\\\"],[\\\"DESKTOP_CHROME\\\"]],[1]]],null,[]]]]\",null,null,null,null,null,null,-21600,null,null,null,null,[],1,null,null,null,null,null,[]]],\"1682921543750\",[]]"
          - url: 'https://www.google.com/async/bgasy'
            method: GET
            label: 'https://www.google.com/async/bgasy'
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-full-version: '"112.0.5615.138"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-model: '""'
              sec-ch-ua-wow64: '?0'
              Accept: '*/*'
            body:
              ei: TlhPZLvVIPDq2roPk_mEmAU
              opi: '89978449'
              yv: '3'
              cs: '1'
              async: '_fmt:jspb'
          - url: 'https://www.demoblaze.com/'
            method: GET
            label: 'https://www.demoblaze.com/'
            think-time: 1211ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
          - url: 'https://www.demoblaze.com/index.html'
            method: GET
            label: 'https://www.demoblaze.com/index.html'
            think-time: 3162ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
          - url: 'https://api.demoblaze.com/entries'
            method: GET
            label: 'https://api.demoblaze.com/entries'
            headers:
              Accept: '*/*'
          - url: 'https://www.demoblaze.com/prod.html'
            method: GET
            label: 'https://www.demoblaze.com/prod.html'
            think-time: 5960ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
            body:
              idp_: '4'
          - url: 'https://www.demoblaze.com/prod.html'
            method: GET
            label: 'https://www.demoblaze.com/prod.html'
            think-time: 14869ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: '"Chromium";v="112.0.5615.138", "Google Chrome";v="112.0.5615.138", "Not:A-Brand";v="99.0.0.0"'
            body:
              idp_: '4#'
          - url: 'https://www.demoblaze.com/config.json'
            method: GET
            label: 'https://www.demoblaze.com/config.json'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
          - url: 'https://api.demoblaze.com/view'
            method: POST
            label: 'https://api.demoblaze.com/view'
            headers:
              Accept: '*/*'
              Content-Type: application/json
            body: '{"id":"4"}'
          - url: 'https://hls.demoblaze.com/index.m3u8'
            method: GET
            label: 'https://hls.demoblaze.com/index.m3u8'
            headers:
              Accept: '*/*'
          - url: 'https://hls.demoblaze.com/about_demo_hls_600k.m3u8'
            method: GET
            label: 'https://hls.demoblaze.com/about_demo_hls_600k.m3u8'
            headers:
              Accept: '*/*'
          - url: 'https://hls.demoblaze.com/about_demo_hls_600k00000.ts'
            method: GET
            label: 'https://hls.demoblaze.com/about_demo_hls_600k00000.ts'
            headers:
              Accept: '*/*'
          - url: 'https://api.demoblaze.com/addtocart'
            method: POST
            label: 'https://api.demoblaze.com/addtocart'
            headers:
              Accept: '*/*'
              Content-Type: application/json
            body: '{"id":"4f549539-0a73-28c8-c752-c56cffe69860","cookie":"user=cfcb449b-cfb1-8262-87c8-f937e6e59e99","prod_id":4,"flag":false}'